planeSymm/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e3;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e3;
    }

    outlet
    {
        type            zeroGradient;
    }

    pipe
    {
        type            omegaWallFunction;
        value           uniform 1e3;
    }

    "(symX|symY)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
