planeSymm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          69;
        startFace       62961;
    }
    outlet
    {
        type            patch;
        nFaces          69;
        startFace       63030;
    }
    pipe
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1980;
        startFace       63099;
    }
    symY
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          4290;
        startFace       65079;
    }
    symX
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          4290;
        startFace       69369;
    }
)

// ************************************************************************* //
